# MightntPlaceInsertsWarning Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..MightntPlaceInsertsWarning Property
BuiltInFailures..::..FamilyFailures Class See Also
---
There exist geometry collision. These elements might not be copied.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MightntPlaceInsertsWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MightntPlaceInsertsWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MightntPlaceInsertsWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace